app/controllers/room_messages_controller.rb

    def create

      @room_message = RoomMessage.create user: current_user,
                                         room: @room,
                                         message: params.dig(:room_message, :message)
---
INSERT INTO "room_messages" ("room_id", "user_id", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["room_id", 1], ["user_id", 1], ["message", "test"], ["created_at", "2024-11-21 03:38:46.790413"], ["updated_at", "2024-11-21 03:38:46.790413"]]

    def load_entities
      @room = Room.find params.dig(:room_message, :room_id)
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]