app/controllers/rooms_controller.rb

    def create
      @room = Room.new permitted_parameters

      if @room.save
---
INSERT INTO "rooms" ("name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["name", "Bengkel Jet Vario"], ["created_at", "2024-11-21 03:42:21.633536"], ["updated_at", "2024-11-21 03:42:21.633536"]]

    def show
      @room_message = RoomMessage.new room: @room
      @room_messages = @room.room_messages.includes(:user)
---
SELECT "room_messages".* FROM "room_messages" WHERE "room_messages"."room_id" = ?  [["room_id", 1]]
SELECT "rooms".* FROM "rooms"

    def load_entities
      @rooms = Room.all
      @room = Room.find(params[:id]) if params[:id]
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]